## Q1. List any five functions of the pandas library with execution.

In [3]:
import pandas as pd

In [2]:
df=pd.DataFrame({"Name":['Dhawal','Hariom','Mayan'],"Age":[22,22,23],"Subject":['Inventory','Queueing','Statistics']})

In [3]:
df

     Name  Age     Subject
0  Dhawal   22   Inventory
1  Hariom   22    Queueing
2   Mayan   23  Statistics

In [4]:
## 1.
df.dtypes

Name       object
Age         int64
Subject    object
dtype: object

In [5]:
## 2.
df.columns

Index(['Name', 'Age', 'Subject'], dtype='object')

In [8]:
## 3.
df.head(1)

     Name  Age    Subject
0  Dhawal   22  Inventory

In [9]:
## 4.
df.tail(2)

     Name  Age     Subject
1  Hariom   22    Queueing
2   Mayan   23  Statistics

In [10]:
## 5.
df.describe()

             Age
count   3.000000
mean   22.333333
std     0.577350
min    22.000000
25%    22.000000
50%    22.000000
75%    22.500000
max    23.000000

## Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [11]:
df=pd.DataFrame({'A':[1,2,3,4,5,6],'B':[11,12,13,14,15,16],'C':[21,22,23,24,25,26]})

In [12]:
df

   A   B   C
0  1  11  21
1  2  12  22
2  3  13  23
3  4  14  24
4  5  15  25
5  6  16  26

In [13]:
df.reindex(index=[1,3,5])

   A   B   C
1  2  12  22
3  4  14  24
5  6  16  26

## Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.
## For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [14]:
df=pd.DataFrame({'Values':[10,20,30,40,50]})

In [15]:
df

   Values
0      10
1      20
2      30
3      40
4      50

In [23]:
sum=0
for i in df['Values'][0:3]:
    sum+=i
    
print(sum)

60

## Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [25]:
df=pd.DataFrame({'Text':['I am Dhawal','I am currently a student','I am pursuing a course,DSM']})

In [26]:
df

                         Text
0                 I am Dhawal
1    I am currently a student
2  I am pursuing a course,DSM

In [31]:
df['Word_count']=[len(i.split()) for i in df['Text']]

In [32]:
df

                         Text  Word_count
0                 I am Dhawal           3
1    I am currently a student           5
2  I am pursuing a course,DSM           5

## Q5. How are DataFrame.size() and DataFrame.shape() different?

## DataFrame.size gives the number of elements in the table.

In [38]:
df.size

6

## DataFrame.shape gives a tuple of number of rows and columns in the table

In [36]:
df.shape

(3, 2)

## Q6. Which function of pandas do we use to read an excel file?

In [ ]:
<DataFrame_name>.read_excel['File_name']

## Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.
## The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [4]:
df=pd.DataFrame({"Email":['dhawal@domain.com','Faiz@domain.com','Abhinav@domain.com']})

In [6]:
df["Usewrname"]=[i.split('@')[0] for i in df['Email']]

In [7]:
df

                Email Usewrname
0   dhawal@domain.com    dhawal
1     Faiz@domain.com      Faiz
2  Abhinav@domain.com   Abhinav

## Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows. For example, if df contains the following values:
###   A B C
### 0 3 5 1
### 1 8 2 7
### 2 6 9 4
### 3 2 3 5
### 4 9 1 2

## Your function should select the following rows: A B C
### 1 8 2 7
### 4 9 1 2
### The function should return a new DataFrame that contains only the selected rows.

In [9]:
df1=pd.DataFrame({"A":[1,5,8,2,9],"B":[11,1,4,6,10],"C":[4,5,6,7,8]})

In [10]:
df1

   A   B  C
0  1  11  4
1  5   1  5
2  8   4  6
3  2   6  7
4  9  10  8

In [35]:
def new_df(df_o):
    df_n=df_o[(df_o["A"] >5) &(df_o["B"] <10)]
    print(df_n)

In [36]:
new_df(df_o=df1)

   A  B  C
2  8  4  6

## Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [37]:
df=pd.DataFrame({'Values':[10,20,30,40,50]})
df.describe()

          Values
count   5.000000
mean   30.000000
std    15.811388
min    10.000000
25%    20.000000
50%    30.000000
75%    40.000000
max    50.000000

## Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [38]:
df=pd.DataFrame({'Sales':[1100,1200,1010,1500,2470,3480,2220,2000,3210,1890],"Date":['20-06-23','21-06-23','22-06-23','23-06-23','24-06-23','25-06-23','26-06-23','27-06-23','28-06-23','29-06-23']})

In [39]:
df

   Sales      Date
0   1100  20-06-23
1   1200  21-06-23
2   1010  22-06-23
3   1500  23-06-23
4   2470  24-06-23
5   3480  25-06-23
6   2220  26-06-23
7   2000  27-06-23
8   3210  28-06-23
9   1890  29-06-23

In [ ]:
for i in range:
    moving_avg=
df['Moving Average']=

## Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column. For example, if df contains the following values:
## Date
### 0 2023-01-01
### 1 2023-01-02
### 2 2023-01-03
### 3 2023-01-04
### 4 2023-01-05
## Your function should create the following DataFrame:

## Date Weekday
### 0 2023-01-01 Sunday
### 1 2023-01-02 Monday
### 2 2023-01-03 Tuesday
### 3 2023-01-04 Wednesday
### 4 2023-01-05 Thursday
### The function should return the modified DataFrame.

In [40]:
df=pd.DataFrame({'Date':['20-06-23','21-06-23','22-06-23','23-06-23','24-06-23','25-06-23','26-06-23']})

In [41]:
df

       Date
0  20-06-23
1  21-06-23
2  22-06-23
3  23-06-23
4  24-06-23
5  25-06-23
6  26-06-23

In [42]:
df['Weekday']=['Monday','Tuesday','Wednesday','Thrusday','Friday','Saturday','Sunday']

In [43]:
df

       Date    Weekday
0  20-06-23     Monday
1  21-06-23    Tuesday
2  22-06-23  Wednesday
3  23-06-23   Thrusday
4  24-06-23     Friday
5  25-06-23   Saturday
6  26-06-23     Sunday

## Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [55]:
df=pd.DataFrame({'Sales':[1100,1200,1010,1500,2470,3480,2220,2000,3210,1890],"Date":['2023-01-20','2023-04-21','2023-05-22','2023-06-23','2023-07-24','2025-01-25','2022-10-26','2023-12-27','2023-09-28','2023-03-29']})

In [56]:
df

   Sales        Date
0   1100  2023-01-20
1   1200  2023-04-21
2   1010  2023-05-22
3   1500  2023-06-23
4   2470  2023-07-24
5   3480  2025-01-25
6   2220  2022-10-26
7   2000  2023-12-27
8   3210  2023-09-28
9   1890  2023-03-29

In [61]:
df1=pd.to_datetime(df['Date'])

In [66]:
df1

0   2023-01-20
1   2023-04-21
2   2023-05-22
3   2023-06-23
4   2023-07-24
5   2025-01-25
6   2022-10-26
7   2023-12-27
8   2023-09-28
9   2023-03-29
Name: Date, dtype: datetime64[ns]

In [70]:
def date(df_given):
    return df_given[(df_given>"2023-01-01") & (df_given <"2023-01-31")]

In [71]:
date(df1)

0   2023-01-20
Name: Date, dtype: datetime64[ns]

## Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

### "pandas"